{"Publication Date":{"0":1653364140000,"1":1653391107000,"2":1653374400000,"3":1653405877000,"4":1653401200000,"5":1653378580000,"6":1653404024000,"7":1653378284000,"8":1653369711000,"9":1653414600000,"10":1653369002000,"11":1653396780000,"12":1653432855000,"13":1653406200000,"14":1653418685000,"15":1653399477000,"16":1653409113000,"17":1653371044000,"18":1653386437000,"19":1653386437000,"20":1653369710000,"21":1653391200000,"22":1653383460000,"23":1653425539000,"24":1653426023000,"25":1653431410000,"26":1653399040000,"27":1653363976000,"28":1653435014000,"29":1653397980000,"30":1653397980000,"31":1653364848000,"32":1653404869000,"33":1653363975000,"34":1653436800000,"35":1653405019000,"36":1653393600000,"37":1653355500000,"38":1653380708000,"39":1653378625000,"40":1653357484000,"41":1653390000000,"42":1653370371000,"43":1653405900000,"44":1653363523000,"45":1653411398000,"46":1653392226000,"47":1653374760000,"48":1653407280000,"49":1653390029000},"Title":{"0":"Duterte hits Putin: I kill criminals, not children, elders - The Associated Press","1":"Marcos Jr. May Have Won This Battle Against the Catholic Church, But the Struggle Isn’t Over","2":"Taiwan radio enthusiasts tune in as Chinese, U.S. warplanes crowd sensitive skies - Reuters.com","3":"Philippines Opens Streaming Channel, Unveils International Subsidy Recipients (EXCLUSIVE)","4":"How Joe Biden’s Asia Trip Shows Chinese Failure","5":"Philippine President Duterte slams Putin for Ukraine killings","6":"Animistic technology: MusicMakers Hacklab CTM Festival flashback…","7":"Ferry catches fire with passengers onboard off the Philippines coast","8":"Live updates | Philippines leader rebukes Putin for killings","9":"Charter Next Generation Invests in Marine Plastic Pollution Clean-Up Efforts","10":"Singapore Pharmacy Platform Startup Lands $27 Million In Bill Gates-Backed Funding Round","11":"Home Ministry to discuss with new source countries on recruiting security workers","12":"7'2\" prospect Kai Sotto to work out with Knicks in hopes of becoming first Philippine-born NBA player","13":"GlobalData Plc: Construction Market Forecast of Asia-Pacific – Bundle Reports Collection","14":"'Death squads' roamed this country on a murderous rampage for years. Will justice finally be served?","15":"Duterte on Putin: \"I kill criminals, I don't kill children and the elderly\"","16":"Philippine President Rodrigo Duterte, Who Once Called Vladimir Putin An ‘Idol,’ Criticizes The Russian Leader","17":"Galaxy A72 gets the May 2022 security update in Asia, Europe","18":"Philippines revises 2022 GDP growth target to 7%-8%","19":"Philippines narrows 2022 GDP growth target due to external risks","20":"Live updates | Philippines leader rebukes Putin for killings","21":"Is Grab Stock a Buy Now?","22":"Downloading Microsoft's Building Footprints","23":"There Are Still Lessons to be Learned from History (Book Review)","24":"Disney Springs Art Walk Celebrates A World of Voices","25":"Explained: The new Indo-Pacific bloc","26":"7 ways to get over 5 cents per point in value from your Chase Ultimate Rewards points","27":"Duterte hits Putin: I kill criminals, not children, elders","28":"Busted! Munoz On Leave After High School Boxing Fiasco","29":"How the Quad can become more than an anti-China grouping","30":"How the Quad can become more than an anti-China grouping","31":"Earn 2x Avios on all Qatar Airways flights (For residents of India & Southeast Asia)","32":"Australian prime minister attacks China at Quad and backs Biden’s stand on Taiwan","33":"Duterte hits Putin: I kill criminals, not children, elders","34":"COVID derailed learning for 1.6 billion students. Here’s how schools can help them catch up","35":"Earn up to 6,000 Avios when you take your first flight with Qatar Airways","36":"KAR Global Launches Enhanced Condition Reports for BacklotCars","37":"The Best-selling Home Appliance Brand Gaabor Achieving Good Performance Again and Creating A Wide Range of Popular Models","38":"Indonesia Raises Reserve Requirement While Holding Key Rate","39":"Southeast Asian online pharmacy platform SwipeRx bags $27M in Series B funding","40":"Quad leaders meet in Tokyo at 2nd in-person summit","41":"The Very Best American Whiskeys 2022 San Francisco World Spirits Competition","42":"Kominfo Partners with 10x1000 Tech for Inclusion to Bring \"Flex\" Fintech Foundation Program to Indonesia - Yahoo Finance","43":"GlobalData Plc: Global Mining Market Forecast – Bundle Reports Collection","44":"Biden launches Indo-Pacific economic framework to counter China","45":"RJ Barrett’s summer plans are set booked through 2024","46":"Southeast Asian Nations Roll the Dice on Biden’s Indo-Pacific Framework","47":"Malaysia's Top Food and Hospitality Exhibition Makes Successful Post-Pandemic Return","48":"Toys\"R\"Us Announces Geoffrey's World Tour","49":"How To Make Every Trip You Take the Greatest, Even on a Budget"},"Article Content":{"0":"MANILA, Philippines (AP) Outgoing Philippine President Rodrigo Duterte sharply criticized Russian leader Vladimir Putin for the killings of innocent civilians in Ukraine, saying while the two of them… [+3424 chars]","1":"The late Catholic Metropolitan Archbishop of Manila, Jaime Cardinal Sin (1928-2005), liked playing up to the inevitable jokes about his name. “Welcome to the house of Sin,” used to be his mirthful gr… [+7001 chars]","2":"SYUHAI, Taiwan, May 24 (Reuters) - Shortly after dawn on a southern Taiwanese beach, Robin Hsu's iPhone pings with the first radio message of the day from Taiwan's air force as it warns away Chinese … [+5157 chars]","3":"The Film Development Council of the Philippines launched the FDCP Channel streaming platform at the Cannes Film Market on Tuesday.\r\nAvailable at launch will be 140 films, including 100 Filipino title… [+3699 chars]","4":"If President Joe Biden’s trip to Asia—marked as it was by his comments on the defense of Taiwan, announcements on a proposed new regional trade pact, and meetings with leaders who exhibit similar lev… [+7794 chars]","5":"In a rare rebuke by an ally, outgoing Philippine President Rodrigo Duterte has slammed Russian leader Vladimir Putin for the killings of innocent civilians in Ukraine by his forces.\r\nKnown as the Pun… [+3002 chars]","6":"CTM Festival is here, rescheduled to May, so with it another collaborative performance laboratory – MusicMakers Hacklab which I co-host with Ariel William Orah this edition. I find myself revisiting … [+2306 chars]","7":"At least seven people were killed when a ferry carrying more than 130 people caught fire while approaching a northeastern Philippine province on Monday.\r\nThe Philippine Coast Guard reported that many… [+286 chars]","8":"MANILA, Philippines Outgoing Philippine President Rodrigo Duterte sharply criticized Russian leader Vladimir Putin for the killings of innocent civilians in Ukraine, saying while the two of them have… [+5020 chars]","9":"Sustainability Leader and North America's Largest Independent Plastic Film Producer, Charter Next Generation (CNG), invests in the Plastic Flamingo (PLAF) - to assist in their efforts to tackle marin… [+5877 chars]","10":"Based in Singapore, SwipeRx enables pharmacists across Southeast Asia to buy medicine through the ... [+] platforms B2B commerce tool.\r\nSwipeRx\r\nPharmacy app SwipeRx raised $27 million in a Series B … [+1402 chars]","11":"PUTRAJAYA: The Home Ministry will hold discussions with the Philippines, Indonesia and Bangladesh on the proposal to recruit workers from these new source countries for the security sector.\r\nHome Min… [+1524 chars]","12":"Filipino NBA prospect Kai Sotto is set to work out with the New York Knicks and at least 11 other teams during this years NBA draft.\r\nSotto, 20, trained in Atlanta last week in the hopes of becoming … [+2190 chars]","13":"GlobalData Plc has announced the latest construction market forecast reports bundle for the Asia-Pacific\r\nLONDON, May 24, 2022 (GLOBE NEWSWIRE) -- The Future of Construction Market in Asia-Pacific ma… [+6873 chars]","14":"In the final days of his wild and bloody presidency, Rodrigo Duterte was wistful about a few things he had yet to achieve for the Philippines. \r\n\"Before I leave, let's finish three or five drug lords… [+8970 chars]","15":"Outgoing Philippine President Rodrigo Duterte sharply criticized Russian leader Vladimir Putin for the killings of innocent civilians in Ukraine, saying while the two of them have been tagged as kill… [+3714 chars]","16":"Philippine President Rodrigo Duterte denounced Russian President Vladimir Putin over his invasion of Ukraine in a televised meeting with government officials Tuesday.\r\nDuterte, who is set to official… [+2380 chars]","17":"Samsung has released a new software update to its most premium mid-range phone from last year, the Galaxy A72. The device has started getting the May 2022 security update in some Asian and most Europ… [+1239 chars]","18":"MANILA : The Philippines has revised its 2022 gross domestic product growth target to 7.0 per cent-8.0 per cent from the previous range of 7.0 per cent-9.0 per cent, the government said on Tuesday\r\nI… [+243 chars]","19":"MANILA : The Philippines has revised its 2022 gross domestic product growth (GDP) target to 7.0 per cent-8.0 per cent from the previous range of 7.0 per cent-9.0 per cent to take into account externa… [+1709 chars]","20":"MANILA, Philippines Outgoing Philippine President Rodrigo Duterte sharply criticized Russian leader Vladimir Putin for the killings of innocent civilians in Ukraine, saying while the two of them have… [+5016 chars]","21":"Grab(GRAB -9.97%), the creator of a \"super app\" that provides transportation, food delivery, and payment services across Southeast Asia, went public by merging with a special purpose acquisition comp… [+4430 chars]","22":"[Image]\r\nMicrosoft's Building Footprints dataset now contains data on 777m buildings around the world. The data can be downloaded in GeoJSON format and can be used under a Open Data Commons Open Data… [+1308 chars]","23":"There Are Still Lessons to be Learned from History\r\nBook Review of Edwin Price Ramsey and Stephen J. 1990. Lieutenant Ramsey's War: From Horse Soldier to Guerrilla Commander. Lincoln: Potomac Books, … [+5193 chars]","24":"The first art installations have begun at the Disney Springs Art Walk, A Canvas of Expression. Were looking forward to the ongoing transformation of this experience as more artists bring their work a… [+2447 chars]","25":"The Indo-Pacific Economic Framework, launched by United States President Joe Biden on Monday and being joined by 12 other countries including India, is Washingtons answer to the Trans Pacific Partner… [+5931 chars]","26":"You’ve worked hard to earn your Chase points, and you want to get the most value when you redeem them.\r\nThere are many ways to redeem your Chase points, but what are the very best redemptions? I’m ta… [+9764 chars]","27":"Outgoing Philippine President Rodrigo Duterte sharply criticized Russian leader Vladimir Putin for the killings of innocent civilians in Ukraine, saying while the two of them have been tagged as kill… [+3399 chars]","28":"Photo by Jeoffrey Maitem\/Zuffa LLC\/Zuffa LLC via Getty Images\r\n\n \n\n Mark Munoz looks to be needing to find a new job following a recent incident at the high school he coaches wrestling at.\nThe former… [+1261 chars]","29":"On May 23, before the Quad leaders summit in Tokyo, the United States launched the Indo-Pacific Economic Framework (IPEF) with a diverse group of 12 countries initially — Australia, Brunei, India, In… [+6389 chars]","30":"On May 23, before the Quad leaders summit in Tokyo, the United States launched the Indo-Pacific Economic Framework (IPEF) with a diverse group of 12 countries initially — Australia, Brunei, India, In… [+6391 chars]","31":"Offer details:\r\nEarn double Avios on all Qatar Airways flights in all fare classes. Book by Jun 5 for travel until Dec 31, 22. Click here for more details &amp; to book this offer.\r\nFor residents of … [+884 chars]","32":"Australias new prime minister Anthony Albanese has criticised China for imposing hefty tariffs on Australian exports two years ago at the Quad summit in Tokyo.\r\nMr Albanese, just days after being swo… [+1872 chars]","33":"MANILA, Philippines (AP) Outgoing Philippine President Rodrigo Duterte sharply criticized Russian leader Vladimir Putin for the killings of innocent civilians in Ukraine, saying while the two of them… [+3422 chars]","34":"By October last year, Meg Brydon could see the terrible toll the pandemic had taken on children at her school. Brydon was a teacher at Ashwood High School, in the suburbs of Melbourne, Australia the … [+20574 chars]","35":"Qatar Airways has a new bonus offer for joining their Privilege Club program and completing your first flight with them. The bonus is 2,000 Avios for Economy Class or 4,000 for business\/first class. … [+1224 chars]","36":"Collaboration with Thoughtworks Expands Capabilities, Accuracy and Transparency\r\nCARMEL, Ind. and CHICAGO, May 24, 2022 \/PRNewswire\/ -- KAR Auction Services, Inc., d\/b\/a\/ KAR Global (NYSE: KAR), a le… [+3545 chars]","37":"MANILA, Philippines , May 24, 2022 \/PRNewswire\/ -- The leading home appliance brand Gaabor has announced good results in its recent online marketing campaigns. On May 5, Gaabor's product sales ranked… [+3195 chars]","38":"(Bloomberg) -- Indonesias central bank tightened reserve requirements for lenders, while keeping its benchmark interest rate unchanged, as it seeks to withdraw excess liquidity without hurting the ec… [+3288 chars]","39":"Singapore-headquartered online pharmacy platform SwipeRx has raised $27 million in a Series B funding round led by MDI Ventures. \r\nIt also received backing from global investors, including the Bill &… [+2050 chars]","40":"Prime Minister Narendra Modi and leaders of the United States, Japan and Australia on Tuesday attended the second in-person meeting of Quad leaders here during which they are expected to exchange vie… [+2837 chars]","41":"The finalists in Best of Class Rye Whiskey\r\nPhoto, courtesy San Francisco World Spirits Competition\/Katlyn Tucker Photography\r\nThe American whiskey category has been growing exponentially over the la… [+8533 chars]","42":"JAKARTA, Indonesia, May 24, 2022--(BUSINESS WIRE)--The Ministry of Communication and Informatics (\"Kominfo\") today announced its partnership with fintech training platform 10x1000 Tech for Inclusion … [+6071 chars]","43":"GlobalData Plc has announced the latest global mining market forecast reports bundle\r\nLONDON, May 24, 2022 (GLOBE NEWSWIRE) -- The Future of the Global Mining Market report compendium focuses on coba… [+9823 chars]","44":"US President Joe Biden has launched a new economic framework geared towards countering Chinese influence in Asia and announced the 12 regional partners who will cooperate on shared standards in areas… [+2531 chars]","45":"RJ Barrett has made a three-summer commitment to the Canadian National Team.\r\nThe Knicks’ budding star was named to his nation’s “core roster” on Tuesday, with the purpose of locking in the 14 player… [+1384 chars]","46":"Advertisement\r\nSeven Southeast Asian nations are among the first nations to sign up to Washingtons long-awaited Indo-Pacific Economic Framework (IPEF). U.S. President Joe Biden launched the long-awai… [+5593 chars]","47":"FHM 2022 provided a welcome resumption of face-to-face business networking during its first post-COVID-19 physical event\r\nKUALA LUMPUR, Malaysia, May 24, 2022 \/PRNewswire\/ -- The 16th edition of Food… [+5469 chars]","48":"New Global Campaign Unites Children Across the U.S.A., Europe, Asia, Middle East, South Africa, Australia and More\r\nNEW YORK, May 24, 2022 \/PRNewswire\/ -- Toys\"R\"Us, the world's leading authority in … [+5276 chars]","49":"After taking a hiatus from traveling during the pandemic, many Americans are now looking to make up for lost time. According to Expedias 2022 Travel Trends Report, more than two-thirds of Americans (… [+5089 chars]"},"Author":{"0":"Jim Gomez","1":"Chad de Guzman \/ Manila","2":null,"3":"Patrick Frater","4":"Michael Schuman","5":"Al Jazeera","6":"Peter Kirn","7":"Francesca Casonato","8":"Via AP news wire","9":"PR Newswire","10":"Simran Vaswani, Forbes Staff, \n Simran Vaswani, Forbes Staff\n https:\/\/www.forbes.com\/sites\/simranvaswani\/","11":"The Star Online","12":"Bryan Ke","13":"GlobalData Plc","14":"Bill Birtles","15":null,"16":"Mary Rooke","17":"Asif S.","18":null,"19":null,"20":"The Associated Press","21":"newsfeedback@fool.com (Leo Sun)","22":"Keir Clarke","23":"Dave Maxwell","24":"Emma Martin","25":"Nirupama Subramanian","26":"Kyle Olsen","27":"Via AP news wire","28":"Drake Riggs","29":"Jagannath Panda","30":"IE Online","31":"Frequent Flyer Bonuses","32":"Maroosha Muzaffar","33":"JIM GOMEZ","34":"Helen Pearson","35":"Frequent Flyer Bonuses","36":"PR Newswire","37":"PR Newswire","38":"Grace Sihombing and Claire Jiao","39":null,"40":"PTI","41":"Joseph V Micallef, Contributor, \n Joseph V Micallef, Contributor\n https:\/\/www.forbes.com\/sites\/joemicallef\/","42":"Business Wire","43":"GlobalData Plc","44":"Julian Bingley","45":"Tribune News Service","46":"Sebastian Strangio","47":"PR Newswire","48":"PR Newswire","49":"Gabrielle Olya"},"Article URL":{"0":"https:\/\/apnews.com\/article\/russia-ukraine-putin-philippines-manila-government-and-politics-103ab9e26bcbcdc2d2d7b837e73b2243","1":"https:\/\/time.com\/6180512\/philippines-marcos-catholic-church\/","2":"https:\/\/www.reuters.com\/world\/asia-pacific\/taiwan-radio-enthusiasts-tune-chinese-us-warplanes-crowd-sensitive-skies-2022-05-24\/","3":"https:\/\/variety.com\/2022\/film\/asia\/philippines-streaming-channel-subsidy-recipients-1235276204\/","4":"https:\/\/www.theatlantic.com\/international\/archive\/2022\/05\/joe-biden-asia-quad-china\/630172\/?utm_source=feed","5":"https:\/\/www.aljazeera.com\/news\/2022\/5\/24\/philippines-president-duterte-slams-putin-for-ukraine-killings","6":"https:\/\/cdm.link\/2022\/05\/animistic-technology-musicmakers-hacklab-ctm-festival-flashback\/","7":"https:\/\/www.independent.co.uk\/tv\/news\/philippines-ferry-fire-dead-b2085913.html","8":"https:\/\/www.independent.co.uk\/news\/vladimir-putin-ap-ukraine-rodrigo-duterte-manila-b2085856.html","9":"https:\/\/finance.yahoo.com\/news\/charter-next-generation-invests-marine-175000684.html","10":"https:\/\/www.forbes.com\/sites\/simranvaswani\/2022\/05\/24\/singapore-pharmacy-platform-startup-lands-27-million-in-bill-gates-backed-funding-round\/","11":"https:\/\/www.thestar.com.my\/news\/nation\/2022\/05\/24\/home-ministry-to-discuss-with-new-source-countries-on-recruiting-security-workers","12":"https:\/\/news.yahoo.com\/72-prospect-kai-sotto-knicks-225415707.html","13":"https:\/\/finance.yahoo.com\/news\/globaldata-plc-construction-market-forecast-153000143.html","14":"https:\/\/www.abc.net.au\/news\/2022-05-25\/philippines-drug-war-at-crossroads-amid-presidential-change\/101092356","15":"https:\/\/www.cbsnews.com\/news\/rodrigo-duterte-on-vladimir-putin-i-kill-criminals-i-dont-kill-children-elderly\/","16":"https:\/\/dailycaller.com\/2022\/05\/24\/philippines-president-rodrigo-duterte-vladimir-putin-russia-ukraine-war\/","17":"https:\/\/www.sammobile.com\/news\/galaxy-a72-may-2022-security-update-asia-europe\/","18":"https:\/\/www.channelnewsasia.com\/business\/philippines-revises-2022-gdp-growth-target-7-8-2703906","19":"https:\/\/www.channelnewsasia.com\/business\/philippines-narrows-2022-gdp-growth-target-due-external-risks-2703906","20":"https:\/\/news.yahoo.com\/live-updates-philippines-leader-rebukes-052150438.html","21":"https:\/\/www.fool.com\/investing\/2022\/05\/24\/is-grab-stock-a-buy-now\/","22":"https:\/\/www.blogger.com\/comment.g?blogID=12158290&postID=1151081385465455338&bpli=1","23":"https:\/\/smallwarsjournal.com\/jrnl\/art\/there-are-still-lessons-be-learned-history-book-review","24":"https:\/\/disneyparks.disney.go.com\/blog\/2022\/05\/disney-springs-art-walk-celebrates-a-world-of-voices\/","25":"https:\/\/indianexpress.com\/article\/explained\/indo-pacific-economic-framework-launched-by-the-us-joe-biden-modi-meet-7934369\/","26":"http:\/\/thepointsguy.com\/guide\/maximum-value-chase-points\/","27":"https:\/\/www.independent.co.uk\/news\/world\/americas\/us-politics\/ap-ukraine-manila-philippines-international-criminal-court-b2085809.html","28":"https:\/\/www.mmamania.com\/2022\/5\/24\/23140472\/mark-munoz-placed-on-administrative-leave-after-letting-high-schoolers-box","29":"https:\/\/indianexpress.com\/article\/opinion\/columns\/how-the-quad-can-become-more-than-an-anti-china-grouping-7934017\/","30":"https:\/\/indianexpress.com\/article\/opinion\/how-the-quad-can-become-more-than-an-anti-china-grouping-7934017\/","31":"https:\/\/blog.frequentflyerbonuses.com\/2022\/05\/earn-2x-avios-on-all-qatar-airways-flights-for-residents-of-india-southeast-asia.html","32":"https:\/\/www.independent.co.uk\/news\/world\/australasia\/biden-quad-tokyo-china-taiwan-b2086041.html","33":"https:\/\/news.yahoo.com\/duterte-hits-putin-kill-criminals-034615267.html","34":"https:\/\/www.nature.com\/articles\/d41586-022-01387-7","35":"https:\/\/blog.frequentflyerbonuses.com\/2022\/05\/earn-up-to-6000-avios-when-you-take-your-first-flight-with-qatar-airways.html","36":"https:\/\/finance.yahoo.com\/news\/kar-global-launches-enhanced-condition-120000148.html","37":"https:\/\/finance.yahoo.com\/news\/best-selling-home-appliance-brand-012500081.html","38":"https:\/\/finance.yahoo.com\/news\/indonesia-raises-limit-while-keeping-075228629.html","39":"https:\/\/www.mobihealthnews.com\/news\/asia\/southeast-asian-online-pharmacy-platform-swiperx-bags-27m-series-b-funding","40":"https:\/\/www.moneycontrol.com\/news\/india\/quad-leaders-meet-in-tokyo-at-2nd-in-person-summit-8562771.html","41":"https:\/\/www.forbes.com\/sites\/joemicallef\/2022\/05\/24\/the-very-best-american-whiskeys-2022-san-francisco-world-spirits-competition\/","42":"https:\/\/finance.yahoo.com\/news\/kominfo-partners-10x1000-tech-inclusion-053100864.html","43":"https:\/\/finance.yahoo.com\/news\/globaldata-plc-global-mining-market-152500058.html","44":"https:\/\/www.zdnet.com\/article\/biden-launches-indo-pacific-economic-framework-to-counter-china\/","45":"https:\/\/www.bostonherald.com\/2022\/05\/24\/rj-barretts-summer-plans-are-set-booked-through-2024\/","46":"https:\/\/thediplomat.com\/2022\/05\/southeast-asian-nations-roll-the-dice-on-bidens-indo-pacific-framework\/","47":"https:\/\/finance.yahoo.com\/news\/malaysias-top-food-hospitality-exhibition-064600143.html","48":"https:\/\/finance.yahoo.com\/news\/toys-r-us-announces-geoffreys-154800984.html","49":"https:\/\/finance.yahoo.com\/news\/every-trip-greatest-even-budget-110029175.html"}}