{"Publication Date":{"0":1655038860000,"1":1655045959000,"2":1655059924000,"3":1655047846000,"4":1655033235000,"5":1655031610000,"6":1655024648000,"7":1655012999000,"8":1655004307000,"9":1655040600000,"10":1655029560000,"11":1655041218000,"12":1655027260000,"13":1655073339000,"14":1654993931000,"15":1655044724000,"16":1655051760000,"17":1655046510000,"18":1654998660000,"19":1655075064000,"20":1655020092000,"21":1655001900000,"22":1655024992000,"23":1655038858000,"24":1655049600000,"25":1655030127000,"26":1655049600000,"27":1655071520000,"28":1655022525000,"29":1655031600000,"30":1655001375000,"31":1655017424000,"32":1655032226000,"33":1655016519000,"34":1655012166000,"35":1655054287000,"36":1655045118000,"37":1655034897000,"38":1655012694000,"39":1654992000000,"40":1655011075000,"41":1655014020000,"42":1655041408000,"43":1655016780000,"44":1655033825000,"45":1655024891000,"46":1655002855000,"47":1655042276000,"48":1655069400000,"49":1655078160000},"Title":{"0":"Analysis: Quebec focuses on French speaking immigrants as companies plea for workers - Reuters","1":"Quebec companies plead for workers as province focuses on French-speaking immigrants - The Globe and Mail","2":"Volcano ash blankets Philippine towns after second eruption this week","3":"China Accuses U.S. of Trying to ‘Hijack’ Support in Asia","4":"Infographic: How many children are forced to work globally?","5":"Meta slammed with eight lawsuits claiming social media hurts kids","6":"China vows to ‘fight to the end’ to prevent Taiwan’s independence","7":"FPIs pull out Rs 14,000-cr from Indian equities in June on global, domestic concerns","8":"IND vs AFG: Sahal Samad’s late strike keeps India’s Asian Cup hopes on track","9":"Statement by the Prime Minister on Philippine Independence Day","10":"Volcano ash blankets Philippine towns after second eruption this week","11":"Social media spreads rumours about Covid vaccine harms … but it doesn’t always start them","12":"Volcano ash blankets Philippine towns after second eruption this week","13":"Explained: BrahMos, 21 and developing","14":"Absent fathers 'programme sons to be aggressive adults","15":"Philippines: Tunnel drilling for first subway set to start, with Japanese machine and cash","16":"Pokémon Championships Singapore Shiny Clefairy distribution announced","17":"Beyond Economics And Geopolitics: Asia In The Global Book Market","18":"China says US has to improve bilateral relationship; vows 'fight to the end' to stop Taiwan independence","19":"UK farmers turn to Nepal and Tajikistan for fruit pickers","20":"China vows it will fight to the end to stop Taiwan independence","21":"China vows 'fight to the end' to stop Taiwan independence","22":"Volcano ash blankets Philippine towns after second eruption this week","23":"China accuses U.S. of trying to \"hijack\" support of Asian countries","24":"Bond Managers Fret Asia Inflation Surge as Local Debt Lags Peers","25":"China vows 'fight to the end' to stop Taiwan independence","26":"S’pore lure makes it harder for Johor hotels to hire","27":"Commentary: ASEAN can shape US-China relations in Southeast Asia","28":"China accuses US of trying to 'hijack' support in Asia","29":"Two Alberta CEOs win thousands in investment at national pitch competition","30":"China accuses US of trying to 'hijack' support in Asia","31":"China accuses US of trying to ‘hijack’ support in Asia","32":"Internet of Things (IoT) Professional Services Market Set for Explosive Growth : Prodapt Solutions, Genpact, Fujitsu, LUXOFT - Digital Journal","33":"\"Taking Us As Threat Will Be Historic Mistake\": China On US Remarks","34":"Foreign Investors Have Sold Indian Stocks Worth Rs 14,000 Crore In June","35":"MoneyGram USDC Transfer Services Already Launched In A Few Countries","36":"Biden’s “Harakiri Diplomacy” in East Asia: War Drums Getting Louder. Threatening Korea and China with the Support of Japan","37":"News24.com | 'There was ash everywhere' - volcano ash blankets Philippine towns after second eruption this week","38":"Taking China as threat and adversary will be historic and strategic mistake: Chinese Defence Minister Wei Fengh","39":"Format Date And Time In SQL Server Using FORMAT Function","40":"China vows 'fight to the end' to stop Taiwan independence","41":"FPIs pull out Rs 14,000-cr from Indian equities in June amid concerns","42":"Quebec focuses on French speaking immigrants as companies plea for workers","43":"Skills gap contributes to widespread cybersecurity breaches - The Manila Times","44":"China accuses US of trying to 'hijack' support in Asia","45":"Volcano ash blankets Philippine towns after second eruption this week","46":"Boxing Results: Jaime Munguia Stops Jimmy “Kilrain” Kelly in Five Rounds!","47":"China accuses U.S. of attempting to 'hijack' support in Asia","48":"Grab your tickets to see Lany in November","49":"Westerdam's Return to Service June 12 in Seattle Marks Holland America Line's Completion of Full Fleet Sailing Again"},"Article Content":{"0":"MONTREAL, June 12 (Reuters) - Quebec's plans to attract more French-speaking newcomers are unnerving some business owners who say they need immigrants from varied backgrounds to address a tight labor… [+4707 chars]","1":"Quebec Premier Francois Legault speaks at a news conference at the legislature in Quebec City on June 10.Jacques Boissinot\/The Canadian Press\r\nQuebecs plans to attract more French-speaking newcomers … [+4720 chars]","2":"A volcano in the Philippines spewed a huge column of ash into the sky on Sunday, blanketing a region still recovering from last week's eruption.\r\nThe blast from Bulusan volcano lasted 18 minutes, the… [+1905 chars]","3":"(SINGAPORE) — China’s defense minister accused the United States on Sunday of trying to “hijack” the support of countries in the Asia-Pacific region to turn them against Beijing, saying Washington is… [+5284 chars]","4":"June 12 marks World Day Against Child Labour an annual event to raise awareness of the economic and social consequences of child labour on children.\r\nAround the world, at least 160 million children a… [+2063 chars]","5":"In brief Facebook and Instagram's parent biz, Meta, was hit with not one, not two, but eight different lawsuits accusing its social media algorithm of causing real harm to young users across the US. … [+5156 chars]","6":"China has vowed to fight to the very end to stop Taiwanese independence and warned that foreign interference in Taiwan is doomed to fail, stoking already soaring tensions with the United States over … [+3680 chars]","7":"Wary of the scenario on the global and domestic fronts, foreign investors continued to withdraw from Indian equity markets and pulled out close to Rs 14,000 crore in this month so far. With this, net… [+2270 chars]","8":"Sahal Samad’s injury-time strike earned India a dramatic 2-1 victory over Afghanistan in Kolkata on Saturday that keeps the country’s hopes of qualifying for next year’s Asian Cup finals alive.Sunil … [+2415 chars]","9":"OTTAWA, ON, June 12, 2022 \/CNW\/ - The Prime Minister, Justin Trudeau, today issued the following statement on Philippine Independence Day:\r\n\"Today, we join Filipino communities across Canada and arou… [+1644 chars]","10":"A volcano in the Philippines spewed a huge column of ash into the sky on Sunday, blanketing a region still recovering from last week's eruption.\r\nThe blast from Bulusan volcano lasted 18 minutes, the… [+1452 chars]","11":"For decades, anti-vaccine movements have generated and spread rumours that vaccines cause serious health problems. The rollout of COVID vaccines has provided new opportunities to spread misinformatio… [+6437 chars]","12":"No casualties were reported, but the seismological agency raised the alert level to one on the five-level system, indicating \"low-level unrest\".\r\n\"We still can't say that it is over. It's still possi… [+708 chars]","13":"On June 12, 2001, the BrahMos supersonic cruise missile was first tested from a land-based launcher in Chandipur. In the 21 years since, BrahMos has been upgraded several times, with versions tested … [+6127 chars]","14":"Absent fathers could be fuelling a vicious cycle by hard- wiring their sons to be aggressive adults who are more likely to abandon their own children.\r\nScientists have found that boys whose fathers p… [+1961 chars]","15":"Published: 10:38pm, 12 Jun, 2022\r\nUpdated: 10:38pm, 12 Jun, 2022","16":"Pokémon Co. has announced that theyll be distributing a Shiny Clefairy in honor of Pokémon Championships Singapore. It will be available June 18th and 19th through the official Facebook pages of Poké… [+327 chars]","17":"Dolly Parton and James Patterson discuss their new book \"Run, Rose, Run: A Novel\" during the 2022 ... [+] SXSW Conference and Festival in March. Patterson's books sell well globally. (Photo by Rick K… [+9084 chars]","18":"Tensions over Taiwan have escalated in particular due to increasing Chinese military aircraft incursions into the island's air defence identification zone (ADIZ).\r\nPresident Joe Biden, during a visit… [+1858 chars]","19":"By Lucy HookerBusiness reporter, BBC News\r\nBal Kumar Khatri has worked harvesting rice and beans in his native Nepal before, and been a trekking guide in the Himalayas. \r\nBut this year, instead, the … [+6154 chars]","20":"China will \"fight to the very end\" to stop Taiwanese independence, the country's defense minister vowed Sunday, stoking already soaring tensions with the United States over the island.\r\nIt was the la… [+2468 chars]","21":"SINGAPORE: China will \"fight to the very end\" to stop Taiwanese independence, the country's defence minister vowed Sunday, stoking already soaring tensions with the United States over the island.\r\nIt… [+2462 chars]","22":"","23":"Singapore — China's defense minister accused the United States on Sunday of trying to \"hijack\" the support of countries in the Asia-Pacific region to turn them against Beijing, saying Washington is s… [+5503 chars]","24":"(Bloomberg) -- Bond investors are avoiding Asias emerging markets as the regions resilience to the global inflation threat shows signs of cracking.\r\nMost Read from Bloomberg\r\nAbrdn plc has turned und… [+4496 chars]","25":"China will \"fight to the very end\" to stop Taiwanese independence, the country's defence minister vowed Sunday, stoking already soaring tensions with the United States over the island. \r\nThe superpow… [+5185 chars]","26":"JOHOR BARU: While hotels around the country are facing a shortage of workers, establishments in Johor are finding it extra hard to recruit as locals are more keen to take up jobs in Singapore due to … [+4057 chars]","27":"Mr Lee Kuan Yew, the former prime minister of Singapore, a strong advocate of balance of power, was so concerned that the American withdrawal from military bases in the Philippines could potentially … [+1440 chars]","28":"China's Defense Minister General Wei Fenghe speaks at a plenary session during the 19th International Institute for Strategic Studies (IISS) Shangri-la Dialogue, Asia's annual defense and security fo… [+5504 chars]","29":"Two Alberta CEOs have won thousands of dollars in investment through a national competition for women and gender-diverse entrepreneurs.\r\nShelvie Fernan from Edmonton and Lourdes Juan from Calgary are… [+5557 chars]","30":"SINGAPORE (AP) China's defense minister accused the United States on Sunday of trying to hijack the support of countries in the Asia-Pacific region to turn them against Beijing, saying Washington is … [+5308 chars]","31":"SINGAPORE China’s defense minister accused the United States on Sunday of trying to hijack the support of countries in the Asia-Pacific region to turn them against Beijing, saying Washington is seeki… [+4789 chars]","32":"This press release was orginally distributed by SBWire\r\nNew Jersey, USA — (SBWIRE) — 06\/12\/2022 — The Latest Released Internet of Things (IoT) Professional Services market study has evaluated the fut… [+8657 chars]","33":"China, US cooperation is vital for global peace and development, China's Defence Minister said. (File)\r\nSingapore: It will be a historic and strategic mistake to insist on taking China as a threat an… [+2103 chars]","34":"FPIs pull out Rs 14,000 crore from Indian equities in June\r\nNew Delhi: Wary of the scenario on the global and domestic fronts, foreign investors have withdrawn from Indian equity markets and pulled o… [+2324 chars]","35":"MoneyGram USDC transfer services have already been launched in multiple countries across the world as we can see more today in our latest altcoin news.\r\nThe MoneyGram payment service was powered by t… [+2640 chars]","36":"All Global Research articles can be read in 51 languages by activating the Translate Website drop down menu on the top banner of our home page (Desktop version).\r\nTo receive Global Researchs Daily Ne… [+18326 chars]","37":"<ul><li>The Mount Bulusan volcano spewed ash over the Philippines.<\/li><li>No deaths were reported.<\/li><li>Flights were cancelled.<\/li><\/ul>\r\nA volcano in the Philippines spewed a huge column of ash… [+1775 chars]","38":"It will be a historic and strategic mistake to insist on taking China as a threat and adversary, or even an enemy, Chinese Defence Minister General Wei Fengh said on Sunday as he underlined that the … [+1886 chars]","39":"Introduction \r\nIn this article, you will learn how to Format Dates in SQL Server. \r\nHere we will use the “FORMAT” function to format a date in SQL Server\r\nPrerequisites\r\n<ul><li>Install SQL Server<\/l… [+16786 chars]","40":"China will 'fight to the very end' to stop Taiwanese independence, the country's defence minister vowed Sunday, stoking already soaring tensions with the United States over the island.\r\nThe superpowe… [+3803 chars]","41":"Wary of the scenario on the global and domestic fronts, foreign investors continued to withdraw from Indian equity markets and pulled out close to Rs 14,000 crore in this month so far.\r\nWith this, ne… [+3670 chars]","42":"Unlike other provinces, Quebec gets to choose its economic immigrants. The government previously lowered the number of new permanent residents it brings in, relying more on temporary workers, and say… [+4270 chars]","43":"IN its global 2022 Cybersecurity Skills Gap Report. Fortinet, a global leader in broad, integrated and automated cybersecurity solutions, reveals that cybersecurity skills shortage continues to accou… [+4010 chars]","44":"China's defence minister accused the United States on Sunday of trying to \"hijack\" the support of countries in the Asia-Pacific region to turn them against Beijing, saying Washington is seeking to ad… [+5256 chars]","45":"Juban (Philippines) (AFP) A volcano in the Philippines spewed a huge column of ash into the sky on Sunday, blanketing a region still recovering from last week's eruption. The blast from Bulusan volca… [+1497 chars]","46":"By Ken Hissner: At the Honda Center, Anaheim, California, Saturday over DAZN Golden Boy Promotions presented in the Main Event WBO World Light Middleweight champion Jaime Munguia of Tijuana, Mexico s… [+6131 chars]","47":"SINGAPORE (AP) China’s defense minister accused the United States on Sunday of trying to hijack the support of countries in the Asia-Pacific region to turn them against Beijing, saying Washington is … [+5796 chars]","48":"Lany, one of the coolest bands on the planet, will make a comeback with \"Lany A November To Remember Live In Bangkok\" at Impact Arena, Muang Thong Thani, on Nov 3 and 4.\r\nIt is almost five months unt… [+1536 chars]","49":"Holland America Line's entire fleet of cruise ships now operating after more than two-year pause due to global pandemic.\r\nTweet this\r\nTo commemorate the occasion, Holland America Line held a ceremony… [+3444 chars]"},"Author":{"0":null,"1":"Anna Mehler Paperny, Allison Lampert","2":"Science X staff","3":"SYAWALLUDIN ZAIN and DAVID RISING\/AP","4":"Alia Chughtai","5":"Katyanna Quach","6":"Al Jazeera","7":"PTI","8":"Reuters","9":"CNW Group","10":"AFP","11":"The Conversation","12":null,"13":"Sushant Kulkarni","14":"Stephen Adams","15":"Kyodo, Kyodo","16":"rawmeatcowboy","17":"Russell Flannery, Forbes Staff, \n Russell Flannery, Forbes Staff\n https:\/\/www.forbes.com\/sites\/russellflannery\/","18":null,"19":"https:\/\/www.facebook.com\/bbcnews","20":null,"21":"AFP","22":"AFP","23":null,"24":"Karl Lester M. Yap and Marcus Wong","25":null,"26":"The Star Online","27":null,"28":"The Associated Press","29":"Tarini Fernando","30":"SYAWALLUDIN ZAIN and DAVID RISING","31":"Associated Press","32":"ReleaseWire","33":null,"34":null,"35":"Stefan","36":"Prof. Joseph H. Chung","37":null,"38":"PTI","39":"Deepak Tewatia","40":"Afp","41":"Press Trust of India","42":null,"43":"Tony Maghirang","44":"AP","45":"FRANCE24","46":"Boxing News","47":"Syawalludin Zain, Associated Press, David Rising, Associated Press","48":null,"49":null},"Article URL":{"0":"https:\/\/www.reuters.com\/world\/americas\/quebec-focuses-french-speaking-immigrants-companies-plea-workers-2022-06-12\/","1":"https:\/\/www.theglobeandmail.com\/business\/article-quebec-focuses-on-french-speaking-immigrants-as-companies-plead-for\/","2":"https:\/\/phys.org\/news\/2022-06-volcano-ash-blankets-philippine-towns.html","3":"https:\/\/time.com\/6186898\/china-us-shangri-la-dialogue\/","4":"https:\/\/www.aljazeera.com\/news\/2022\/6\/12\/infographic-how-many-children-are-forced-to-work","5":"https:\/\/www.theregister.com\/2022\/06\/12\/in-brief-ai\/","6":"https:\/\/www.aljazeera.com\/news\/2022\/6\/12\/china-warns-us-it-will-fight-to-the-end-for-taiwan","7":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/fpis-pull-out-rs-14000-cr-from-indian-equities-in-june-on-global-domestic-concerns\/articleshow\/92157550.cms","8":"https:\/\/indianexpress.com\/article\/sports\/football\/ind-vs-afg-sahal-samad-late-strike-keeps-indias-asian-cup-hopes-on-track-7965405\/","9":"https:\/\/finance.yahoo.com\/news\/statement-prime-minister-philippine-independence-133000475.html","10":"https:\/\/www.bangkokpost.com\/world\/2324658\/volcano-ash-blankets-philippine-towns-after-second-eruption-this-week","11":"https:\/\/indianexpress.com\/article\/lifestyle\/health\/social-media-spreads-rumours-about-covid-vaccine-harms-but-it-doesnt-always-start-them-7965874\/","12":"https:\/\/www.channelnewsasia.com\/asia\/philippines-volcano-ash-blankets-town-after-second-eruption-2742391","13":"https:\/\/indianexpress.com\/article\/explained\/explained-brahmos-21-and-developing-7966393\/","14":"https:\/\/www.dailymail.co.uk\/news\/article-10907985\/Absent-fathers-programme-sons-aggressive-adults.html","15":"https:\/\/www.scmp.com\/news\/asia\/southeast-asia\/article\/3181435\/philippines-tunnel-drilling-first-subway-set-start","16":"https:\/\/gonintendo.com\/contents\/4914-pokemon-championships-singapore-shiny-clefairy-distribution-announced","17":"https:\/\/www.forbes.com\/sites\/russellflannery\/2022\/06\/12\/beyond-economics-and-geopolitics-asia-in-the-global-book-market\/","18":"https:\/\/www.channelnewsasia.com\/asia\/china-says-us-has-improve-bilateral-relationship-vows-fight-end-stop-taiwan-independence-2741996","19":"https:\/\/www.bbc.co.uk\/news\/business-61603429","20":"https:\/\/japantoday.com\/category\/world\/China-vows-it-will-fight-to-the-end-to-stop-Taiwan-independence","21":"https:\/\/www.bangkokpost.com\/world\/2324603\/china-vows-fight-to-the-end-to-stop-taiwan-independence","22":"https:\/\/timesofindia.indiatimes.com\/world\/rest-of-world\/volcano-ash-blankets-philippine-towns-after-second-eruption-this-week\/articleshow\/92159986.cms","23":"https:\/\/www.cbsnews.com\/news\/china-us-asia-taiwan-hijack-support\/","24":"https:\/\/finance.yahoo.com\/news\/bond-managers-fret-asia-inflation-160000816.html","25":"https:\/\/www.sinodaily.com\/reports\/China_vows_fight_to_the_end_to_stop_Taiwan_independence_999.html","26":"https:\/\/www.thestar.com.my\/news\/nation\/2022\/06\/13\/spore-lure-makes-it-harder-for-johor-hotels-to-hire","27":"https:\/\/www.channelnewsasia.com\/commentary\/asean-china-us-power-balance-defence-alliance-2742261","28":"https:\/\/www.npr.org\/2022\/06\/12\/1104414204\/china-accuses-us-of-trying-to-hijack-support-in-asia","29":"https:\/\/www.cbc.ca\/news\/canada\/calgary\/alberta-entrepreneurs-national-pitch-competition-1.6485766","30":"https:\/\/news.yahoo.com\/china-accuses-us-trying-hijack-023615204.html","31":"https:\/\/nypost.com\/2022\/06\/12\/china-accuses-us-of-trying-to-hijack-support-in-asia\/","32":"https:\/\/www.digitaljournal.com\/pr\/internet-of-things-iot-professional-services-market-set-for-explosive-growth-prodapt-solutions-genpact-fujitsu-luxoft","33":"https:\/\/www.ndtv.com\/world-news\/taking-us-as-threat-will-be-historic-mistake-says-chinas-defence-minister-general-wei-fengh-on-us-remarks-on-taiwan-3059926","34":"https:\/\/www.ndtv.com\/business\/fpis-pull-out-rs-14-000-cr-from-indian-equities-in-june-on-global-domestic-concerns-3059812","35":"https:\/\/www.dcforecasts.com\/stellar-news\/moneygram-usdc-transfer-services-already-launched-in-a-few-countries\/","36":"https:\/\/www.globalresearch.ca\/bidens-harakiri-diplomacy-in-east-asia-war-drums-getting-louder-threatening-korea-and-china-with-the-support-of-japan\/5783137","37":"https:\/\/www.news24.com\/news24\/World\/News\/there-was-ash-everywhere-volcano-ash-blankets-philippine-towns-after-second-eruption-this-week-20220612","38":"https:\/\/economictimes.indiatimes.com\/news\/defence\/taking-china-as-threat-and-adversary-will-be-historic-and-strategic-mistake-chinese-defence-minister-wei-fengh\/articleshow\/92157479.cms","39":"https:\/\/www.c-sharpcorner.com\/article\/format-date-and-time-in-sql-server-using-format-function\/","40":"https:\/\/www.dailymail.co.uk\/news\/article-10908095\/China-vows-fight-end-stop-Taiwan-independence.html","41":"https:\/\/www.business-standard.com\/article\/markets\/fpis-pull-out-rs-14-000-cr-from-indian-equities-in-june-amid-concerns-122061200180_1.html","42":"https:\/\/bdnews24.com\/world\/americas\/2022\/06\/12\/quebec-focuses-on-french-speaking-immigrants-as-companies-plea-for-workers","43":"https:\/\/www.manilatimes.net\/2022\/06\/12\/business\/sunday-business-it\/skills-gap-contributes-to-widespread-cybersecurity-breaches\/1846991","44":"https:\/\/economictimes.indiatimes.com\/news\/defence\/china-accuses-us-of-trying-to-hijack-support-in-asia\/articleshow\/92161780.cms","45":"https:\/\/www.france24.com\/en\/live-news\/20220612-volcano-ash-blankets-philippine-towns-after-second-eruption-this-week","46":"https:\/\/www.boxingnews24.com\/2022\/06\/boxing-results-jaime-munguia-stops-kelly\/","47":"https:\/\/www.pbs.org\/newshour\/world\/china-accuses-u-s-of-attempting-to-hijack-support-in-asia","48":"https:\/\/www.bangkokpost.com\/life\/social-and-lifestyle\/2325018\/grab-your-tickets-to-see-lany-in-november","49":"https:\/\/www.prnewswire.com\/news-releases\/westerdams-return-to-service-june-12-in-seattle-marks-holland-america-lines-completion-of-full-fleet-sailing-again-301566252.html"}}